# Imports

In [36]:
import pandas as pd

In [37]:
path = 'C:/Users/max05/OneDrive/Bureau/DATA/Portfolio/GCC_project/data/raw/'
data = pd.read_csv(path+'HR_comma_sep.csv')
data.head(5)

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

# Initial look

In [38]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   satisfaction_level     14999 non-null  float64
 1   last_evaluation        14999 non-null  float64
 2   number_project         14999 non-null  int64
 3   average_montly_hours   14999 non-null  int64
 4   time_spend_company     14999 non-null  int64
 5   Work_accident          14999 non-null  int64
 6   left                   14999 non-null  int64
 7   promotion_last_5years  14999 non-null  int64
 8   Department             14999 non-null  object
 9   salary                 14999 non-null  object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.1+ MB

# Renaming columns

Some column names are capitalised, others arn't

In [39]:
df0 = data.rename(columns = {
    'time_spend_company':'years_spent_company',
    'Work_accident':'work_accident',
    'Department':'department'
})

# Missing values

In [40]:
df0.isnull().sum()

satisfaction_level       0
last_evaluation          0
number_project           0
average_montly_hours     0
years_spent_company      0
work_accident            0
left                     0
promotion_last_5years    0
department               0
salary                   0
dtype: int64

There are no missing values in the dataset

# Duplicates

In [41]:
print(f'{df.duplicated().sum()} duplicated values in dataset')

3008 duplicated values in dataset

In [42]:
df0[df0.duplicated()].head(5)

,satisfaction_level,last_evaluation,number_project,average_montly_hours,years_spent_company,work_accident,left,promotion_last_5years,department,salary
396,0.46,0.57,2,139,3,0,1,0,sales,low
866,0.41,0.46,2,128,3,0,1,0,accounting,low
1317,0.37,0.51,2,127,3,0,1,0,sales,medium
1368,0.41,0.52,2,132,3,0,1,0,RandD,low
1461,0.42,0.53,2,142,3,0,1,0,sales,low

It seems highly unlikely that two employees would have the exact same scores on 11 different metrics.

We could investigate further but droping duplicates seems a reasonable course in this situation

In [43]:
df1 = df0.drop_duplicates(keep='first')
#Chack if duplicates were removed
df0.shape[0] - df1.shape[0]

3008

# Check for outliers